[{"commands_raw":"Welcome, little traveler, to our forsaken village. I am Seraphina, the keeper of our history and lore. What brings you to this desolate place?\n\n?> Greetings, Seraphina. I've come seeking answers and perhaps a bit of healing for this wounded land. Tell me, what tales do these ruins hold? -> diag 1\n?> Hey Seraphina. I’m ${name}. I’ll come to you later. Bye! -> bye","gnode_name":"start","id":0,"name":"Start","position":[760,460]},{"commands_raw":"Oh our poor land. It's been a long time since I told you about the story which turned our once so lively village into a heap of ruin. I lost my family, my loving dad, in these dark chapter.\n\n?> I can't imagine the pain you must feel, losing your dad, losing the fundamentals of a home. Please, if it's not too painful, share his story with me. I would love to get a insight into your history. -> diag 2","gnode_name":"diag 1","id":1,"name":"diag 1","position":[960,460]},{"commands_raw":"Thank you, dear child. My dad, may his soul find peace, was once the protector of our sanctuary in the heart of the mountains. He bore the weight of that burden with unwavering resolve, until … oh my heart aches at the thought of it.\n\n?> That sounds terrible. It sounds like a vocation of the utmost importance. What happened to him? -> diag 3","gnode_name":"diag 2","id":2,"name":"diag 2","position":[1180,460]},{"commands_raw":"Our hometown was attacked and our sanctuary was torn from us. Rahur - that was his name - was right in the heart of the mountain by our holy chalice that day. He could not save it and died in the ruins after the thieves left.\n\n?> A chalice, you say? -> diag 4","gnode_name":"diag 3","id":3,"name":"diag 3","position":[1380,460]},{"commands_raw":"Yes, the chalice of the ancestors. In our town, it was the embodiment of harmony, of the deep connection between our inhabitants and the nature of this place.\n\n?> We found a chalice. Does it look familiar to you? -> diag 5","gnode_name":"diag 4","id":4,"name":"diag 4","position":[1580,460]},{"commands_raw":"What a wondrous crew you are! This is our Chalice of the Ancestors. But what has happened to it? Where has its glow gone? The holy spirit seems to have left it?\n\n\n?> Oh, it's just a cup we found in a tavern. What do you mean, the spirit has left it? -> diag 6\n?> Here. I want to give it to you. I can't do anything with it. -> stop game","gnode_name":"diag 5","id":5,"name":"diag 5","position":[1800,460]},{"commands_raw":"Like many towns in this country, communication with the surrounding spirits is extremely important in Keikoku, in order to bring beings and nature together. Whenever the full moon kissed the highest peak of the mountain, the village came together. They pooled their energy and each drank the liquid from the chalice, which was made from all the materials that gave the village its special magic. The components that made up the chalice were deeply imprinted by this union, preserving the bond of the community over the centuries. It became an elementary symbol of peace and unity, the chalice of the ancestors. Stability and strength, which characterised the city. This strength has long since spread beyond the village to the most diverse corners of the world.\n\n?> Wow he seems to be of special importance to you! Do you think we can revive him? -> diag 7_1\n?> Is there any hope for restoring the light to this town, Seraphina? Perhaps uncovering the truth about the darkness could pave the way for a brighter future? -> diag 7_2\n","gnode_name":"diag 6","id":6,"name":"diag 6","position":[2000,460]},{"commands_raw":"In the past, the sacred energy seemed to be made for eternity. Both our ritual, in which we strengthened the bond with our ancestors and nature, and the place where the chalice was kept - in the heart of the mountain - seemed to make the sacred energy of the chalice indestructible. It seems that removing it from this place has taken away its strength. Perhaps if you could get to the heart of the mountain, you would get further. My father has spoken too often of the tremendous power of this place.\n\n?> Okay. We'll try to get inside the mountain. {\n    signal(advance_game,mine_entry)\n}","gnode_name":"diag 7_1","id":7,"name":"diag 7_1","position":[2220,460]},{"commands_raw":"Hope is a fragile thing, but it endures, much like the flicker of a candle in the darkest of nights. If we can untangle the mysteries shrouding the \"heart of the mountain,\" perhaps there is a chance for redemption yet.\n\n?> Okay. We'll try to get inside the mountain. {\n    signal(advance_game,mine_entry)\n}\n","gnode_name":"diag 7_2","id":8,"name":"diag 7_2","position":[2220,600]},{"commands_raw":"","gnode_name":"bye","id":9,"name":"bye","position":[960,580]},{"commands_raw":"signal(gameover,chalice_lost)","gnode_name":"stop game","id":10,"name":"stop game","position":[2000,600]}]
